In [1]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [2]:
df

   age   name  num_children  num_pets       state
0   23   john             2         0        iowa
1   78   mary             2         4          dc
2   22  peter             0         0  california
3   19   jeff             1         5       texas
4   45   bill             2         0  washington
5   33   lisa             1         0          dc

In [3]:
df.loc[2:4, 'name']

2    peter
3     jeff
4     bill
Name: name, dtype: object

In [4]:
df.loc[:, ['name', 'age']]

    name  age
0   john   23
1   mary   78
2  peter   22
3   jeff   19
4   bill   45
5   lisa   33

In [8]:
df.iloc[:2]

   age  name  num_children  num_pets state
0   23  john             2         0  iowa
1   78  mary             2         4    dc